#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNTRkNTI3My01MmQ1LTQ3OTUtYWFhNS00NTMxZTQwYWJhNjE7b2JqZWN0SWQ9NzYxYzY5OTgtMzBlMS00MDExLWI3NzEtZDM0MzljODdlZDQ0O3N1YnNjcmlwdGlvbklkPTI0OTUwNzhkLTEyMzktNDFmMS04ZTQ5LTk5MWIxYjhiYTIyNjt0ZW5hbnRJZD1lNjUxMDdhZS1kZWFhLTRmNzYtYjc5ZS1jNGI1MDY3YTU5Mjk=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resource-group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "arg-ec-01"
      + tags     = {
          + "environment" = "dev"
        }
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "uai-dev-e01"
      + principal_id        = (known after apply)
      + resource_group_name = "arg-ec-01"
      + tags                = {
          + "environment" = "dev"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + resource_group_name = "arg-ec-01"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ericchen-lab3nz, Action: `pull_request`*